testing/performance/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warmup phase"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 100
      name: "Sustained load"
    - duration: 60
      arrivalRate: 200
      name: "Peak load"
  processor: "./load-test-processor.js"
  variables:
    blockchainNetwork: "polygon-mumbai"
    testWallet: "0x1234567890123456789012345678901234567890"
    testFile: "test-data.json"
  plugins:
    expect: {}
    metrics-by-endpoint: {}
    pubsub: {}

scenarios:
  - name: "SylOS Desktop Interaction"
    weight: 40
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
            - contentType: "text/html"
      - think: 2
      - post:
          url: "/api/wallet/connect"
          json:
            method: "eth_requestAccounts"
            params: []
          expect:
            - statusCode: 200
      - think: 1
      - post:
          url: "/api/pop/score"
          json:
            action: "get_score"
            wallet: "{{ blockchainNetwork }}"
          expect:
            - statusCode: 200
            - hasProperty: "score"
      - think: 1
      - get:
          url: "/api/wallet/balance/{{ testWallet }}"
          expect:
            - statusCode: 200
            - hasProperty: "sylos_balance"
      - think: 1
      - get:
          url: "/api/tokens/portfolio"
          expect:
            - statusCode: 200
            - hasProperty: "total_value"
      - think: 2

  - name: "PoP Consensus Performance"
    weight: 25
    flow:
      - post:
          url: "/api/pop/verify_task"
          json:
            task_id: "{{ $randomString() }}"
            wallet: "{{ testWallet }}"
            productivity_score: "{{ $randomInt(1000, 10000) }}"
            verification_data: "test_verification_{{ $randomString() }}"
          expect:
            - statusCode: 200
            - hasProperty: "verified"
            - hasProperty: "points_awarded"
      - think: 0.5
      - post:
          url: "/api/pop/calculate_reward"
          json:
            score: "{{ $randomInt(5000, 15000) }}"
            tier: "{{ $randomChoice(['Bronze', 'Silver', 'Gold', 'Diamond']) }}"
            week: 45
          expect:
            - statusCode: 200
            - hasProperty: "weekly_reward"
            - hasProperty: "monthly_projection"
      - think: 0.5
      - post:
          url: "/api/pop/update_tier"
          json:
            current_score: "{{ $randomInt(8000, 12000) }}"
            previous_score: "{{ $randomInt(6000, 10000) }}"
          expect:
            - statusCode: 200
            - hasProperty: "new_tier"
            - hasProperty: "tier_changed"
      - think: 1

  - name: "IPFS Storage Performance"
    weight: 20
    flow:
      - post:
          url: "/api/ipfs/upload"
          json:
            filename: "test_file_{{ $randomString() }}.txt"
            content: "Test content for performance testing {{ $randomString() }}"
            encrypted: false
          expect:
            - statusCode: 200
            - hasProperty: "cid"
            - hasProperty: "size"
      - think: 1
      - get:
          url: "/api/ipfs/cat/{{ $randomChoice(['QmXwN9dYd4T8J2kF3mZpA8hE9xN5vL2qR4mN7bC6dF3gH1jK5mN', 'QmYf7rEs2R6gQ5hP3xKvT8uJ2nM5pL4kF9dS7wE3rT6yU1iO3pQ', 'QmA1B2C3D4E5F6G7H8I9J0K1L2M3N4O5P6Q7R8S9T0U1V2']) }}"
          expect:
            - statusCode: 200
            - hasProperty: "content"
      - think: 0.5
      - get:
          url: "/api/ipfs/ls"
          expect:
            - statusCode: 200
            - hasProperty: "files"
            - property: "files[0].size" < 10485760
      - think: 2

  - name: "Token Operations Performance"
    weight: 10
    flow:
      - post:
          url: "/api/tokens/transfer"
          json:
            token: "SYLOS"
            from: "{{ testWallet }}"
            to: "0xabcdef1234567890abcdef1234567890abcdef1234"
            amount: "100.5"
            gas_price: "20"
          expect:
            - statusCode: 200
            - hasProperty: "transaction_hash"
            - hasProperty: "gas_used"
      - think: 0.5
      - post:
          url: "/api/tokens/stake"
          json:
            token: "SYLOS"
            amount: "1000"
            lock_period: 30
            staking_pool: "default"
          expect:
            - statusCode: 200
            - hasProperty: "stake_id"
            - hasProperty: "apy"
      - think: 0.5
      - get:
          url: "/api/tokens/price/track"
          json:
            tokens: ["SYLOS", "wSYLOS"]
          expect:
            - statusCode: 200
            - hasProperty: "prices"
            - property: "prices.SYLOS" > 0
      - think: 3

  - name: "Mobile App Performance"
    weight: 5
    flow:
      - get:
          url: "/mobile"
          headers:
            User-Agent: "Mozilla/5.0 (iPhone; CPU iPhone OS 16_0 like Mac OS X) AppleWebKit/605.1.15"
          expect:
            - statusCode: 200
            - contentType: "text/html"
      - think: 1
      - post:
          url: "/api/mobile/lockscreen/unlock"
          json:
            method: "swipe"
            direction: "up"
            timestamp: "{{ $now }}"
          expect:
            - statusCode: 200
            - hasProperty: "unlocked"
      - think: 0.5
      - get:
          url: "/api/mobile/apps/launch"
          json:
            app: "wallet"
            user_id: "test_user_mobile"
          expect:
            - statusCode: 200
            - hasProperty: "app_loaded"
      - think: 1